huygithcm/code_tung/esp32_car/src/main.cpp
/*
 * FIRMWARE TEST / HIEU CHUAN  -  Xe do line ESP32
 * Test: 2 Motor DC (L298N) + 2 Encoder + Servo tha hang + Buzzer
 *
 * Dieu khien qua Serial Monitor (115200 baud, gui kem Newline).
 * Go lenh roi Enter. Go "?" de xem menu.
 *
 * Chua bat WiFi - chi de test phan cung va lay so lieu hieu chuan
 * (duong kinh banh, PPR encoder, goc servo giu/tha).
 */

#include <Arduino.h>
#include <ESP32Servo.h>
#include <Preferences.h>
#include <WiFi.h>
#include <WebServer.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <Wire.h>
#include <WiFiUdp.h>

// ===================== WiFi (STA - noi WiFi nha) =====================
// SUA ten/mat khau WiFi nha ban o day:
#define WIFI_SSID "THANH TUNG L1"       // <-- SUA ten WiFi
#define WIFI_PASS "0348903226"  // <-- SUA mat khau WiFi

// Hub (server Node) - IP may chay server + cong WS THUONG cho xe (= PORT+2 = 3002)
// Chi la MAC DINH du phong: xe TU TIM hub qua UDP broadcast (khong can sua tay).
#define HUB_HOST "192.168.1.32"
#define HUB_PORT 3002
#define DISC_PORT 3003             // cong UDP discovery cua server (= PORT+3)

WebServer server(80);
bool wifiOK = false;
Preferences prefs;

// ===== Cau hinh mang runtime (sua qua Serial, luu NVS). Mac dinh = #define tren =====
String cfgSsid = WIFI_SSID;   // ten WiFi
String cfgPass = WIFI_PASS;   // mat khau WiFi
String cfgHub  = HUB_HOST;    // IP laptop chay server.js

// Forward declaration (dinh nghia o cuoi file, dung trong handleCommand)
void setupWiFi();
void startHub();
void startOTA();
void onWifiUp();
void saveNetConfig();
bool computeLineError();
void hubLog(const String& s);   // in Serial + day log len hub (web doc duoc)

// ===================== Che do build =====================
// -DDEBUG_MODE=1 (env:debug)  -> in log, telemetry dinh ky
// -DDEBUG_MODE=0 (env:release)-> tat log de chay nhanh/gon
#ifndef DEBUG_MODE
#define DEBUG_MODE 1          // mac dinh: debug
#endif
#if DEBUG_MODE
  #define DBG(...)   Serial.printf(__VA_ARGS__)
  #define DBGLN(x)   Serial.println(x)
#else
  #define DBG(...)   do{}while(0)
  #define DBGLN(x)   do{}while(0)
#endif

// ===================== CHAN (theo PLAN.md) =====================
// Motor A (banh TRAI)
#define MA_IN1 18
#define MA_IN2 19
#define MA_EN  21
// Motor B (banh PHAI)
#define MB_IN3 22
#define MB_IN4 4
#define MB_EN  16
// Encoder trai (A/B)  -- da hoan doi: 2 encoder bi dao nhau tren xe
#define ENC_L_A 15
#define ENC_L_B 17
// Encoder phai (A/B)  -- dao A/B de sua chieu dem
#define ENC_R_A 14
#define ENC_R_B 13
// Servo tha hang
#define SERVO_PIN 5
// Buzzer
#define BUZZER 23
// MUX 74HC4067 (8 mat do line)
#define MUX_SIG 36
#define MUX_S0  27
#define MUX_S1  26
#define MUX_S2  25
// MUX_S3: chi dung 8 kenh (CH0..CH7) -> S3 luon = 0 -> NOI THANG XUONG GND tren board.
// Nho vay GPIO33 duoc giai phong lam SCL cho MPU6050.
// MPU6050 (I2C) - do gyro Z de hop nhat voi odometry (chinh xac hon khi banh truot)
#define MPU_SDA  32
#define MPU_SCL  33
#define MPU_ADDR 0x68
#define LINE_THRESHOLD 2000   // nguong den/trang (analog 0..4095)
// Mat cam bien con tot (false = bo qua). C1 hong -> mask.
bool SENSOR_OK[8] = { false, true, true, true, true, true, true, true };

// ===================== PWM (LEDC) =====================
#define PWM_FREQ 5000   // 5 kHz cho motor
#define PWM_RES  8      // 8-bit -> duty 0..255
// LEDC: timer = (channel/2) % 4  -> 2 channel lien tiep DUNG CHUNG 1 timer!
// ESP32Servo tu cap phat tu channel 0 (timer 0) va KHONG biet cac ledcSetup() goi truc tiep.
//   servo   = ch0        -> timer 0
//   motor   = ch2, ch3   -> timer 1
//   buzzer  = ch4        -> timer 2  (PHAI khac timer servo!)
// Truoc day buzzer = ch1 -> timer 0 = TRUNG timer servo: moi lan beep, ledcSetup doi
// timer 0 sang tan so beep (8-bit) -> servo mat xung 50Hz -> GIAT/QUAY LOAN.
#define MA_CH    2      // LEDC channel Motor A (ENA)
#define MB_CH    3      // LEDC channel Motor B (ENB)
#define BUZZER_CH 4     // LEDC channel Buzzer (timer 2 - tach khoi servo/motor)

// ===================== Thong so hieu chuan =====================
// Sua sau khi do thuc te
float WHEEL_DIAMETER_MM = 71.4;   // duong kinh banh HIEU DUNG (mm) - do bang caldist tren 1 canh
                                  // 475mm: lan1 772 xung -> 72.46 ; lan3 794.5 xung -> 70.41.
                                  // Lay trung binh 71.4. Sai so lap ~3% do xe LUON khi bam line
                                  // (luon nhieu -> quang duong dai hon -> Ø tinh ra nho hon).
int   ENCODER_PPR       = 370;    // so xung / vong
float WHEEL_BASE_MM     = 170.0;  // khoang cach tam 2 banh sau (mm)
float CASTER_DIST_MM    = 100.0;  // khoang cach truc banh sau -> banh tu do (mm)

// Goc servo (do)
int SERVO_HOLD = 180;  // goc GIU hang
int SERVO_DROP = 90;   // goc THA hang

// Dao chieu motor neu banh quay nguoc (doi true/false roi flash lai)
bool INVERT_A = true;   // banh TRAI (L)
bool INVERT_B = true;   // banh PHAI (R)

// ===================== Bien toan cuc =====================
Servo servo;
int   motorSpeed = 210;            // toc do hien tai 0..255 (mac dinh 210)
int   MOTOR_MIN_PWM = 120;         // san PWM: lenh khac 0 nhung < nguong -> nang len (motor keu ma khong quay = duoi nguong khoi dong)
volatile long encL = 0;            // dem xung encoder trai
volatile long encR = 0;            // dem xung encoder phai
bool  streamLine = false;          // true = in lien tuc gia tri 8 mat
int   lineRaw[8];                  // gia tri analog 8 mat (C1..C8)
int   lineMin[8], lineMax[8];      // min/max moi mat khi cali
int   lineThresh[8];               // nguong rieng moi mat
bool  lineCalibrated = false;      // da cali chua

// --- Bam line PID ---
bool  lineFollow = false;          // dang bam line?
float Kp = 25.0, Ki = 0.0, Kd = 15.0;
float lineError = 0, lastError = 0, errIntegral = 0;
int   baseSpeed = 200;             // toc do co ban khi bam line (tren nguong khoi dong)
bool  lineLost = false;            // mat line?
float LINE_TRIM = 0.5;             // tam that cua mang cam bien (don vi = khoang cach 1 mat).
                                   // C1 mask -> dung C2..C8 -> tam hinh hoc = +0.5.
                                   // Dat lai tu dong: de line dung cho muon bam roi gui {"cmd":"linezero"}

// --- Odometry (toa do tuong doi) ---
float poseX = 0, poseY = 0, poseTheta = 0;   // mm, mm, rad
long  lastOdoL = 0, lastOdoR = 0;

// --- Re CO DINH (open-loop: PWM + thoi gian, KHONG PID/gyro-feedback) ---
// Ban PID cu (dua vao gyro+encoder) hay bi LAC/TIMEOUT do 2 ben trai/phai khong that su
// doi xung (ma sat/motor khac nhau). Doi sang re CO DINH: chay 1 PWM co dinh trong thoi
// gian re -> don gian, KHONG lac, KHONG timeout.
// QUAN TRONG: quan he thoi_gian -> goc_thuc KHONG ti le thuan tu 0 - co "thoi gian chet"
// khoi dong (thang ma sat tinh) truoc khi banh thuc su lan. Do tu nhieu lan Test re (gyro
// rat on dinh qua nhieu lan do doc lap): goc(do) = GYRO_DPS_RATE*ms - TURN_MS_OFFSET*GYRO_DPS_RATE,
// tuc ms = TURN_MS_OFFSET + |goc| * TURN_MS_PER_DEG (offset + tuyen tinh, KHONG phai ms=goc*const).
int   TURN_OPEN_PWM   = 220;      // PWM khi re (co dinh, du manh de thang ma sat ca 2 chieu)
// 2 ben TRAI/PHAI khong hoan toan doi xung (ma sat, motor) -> tach rieng he so moi ben,
// deu tinh ms = OFFSET_x + |goc| * PERDEG_x. Hieu chuan rieng bang "Test re" +90/-90.
float TURN_MS_OFFSET_L = 65.0, TURN_MS_PER_DEG_L = 4.57;   // ben TRAI (goc > 0, CCW)
float TURN_MS_OFFSET_R = 65.0, TURN_MS_PER_DEG_R = 4.57;   // ben PHAI (goc < 0, CW)
bool  INVERT_TURN = false;        // dao chieu actuation vong re (sua bang serial: TI)

// --- Dieu phoi: WebSocket client toi hub + bo thuc thi route ---
WebSocketsClient wsClient;
bool   hubOK = false;             // dang ket noi hub?
String route[48];                 // chuoi buoc F/L/R/B/DROP/HOME
float  routeDist[48];             // khoang cach (mm) ky vong cho buoc 'F' tuong ung (0 = khong biet)
int    routeN = 0, routeIdx = 0;  // so buoc + buoc dang chay
String routeTarget = "";          // ma o dang giao (C1..C9), "" = khong
bool   running = false;           // dang chay 1 don giao?
int    stepPhase = 0;             // 0 = re/khoi dong doan, 1 = tien bam line, 2 = bo canh tam nga tu
float  segStartX = 0, segStartY = 0;  // moc odometry dau doan
bool   leftStart = false;         // da roi giao diem xuat phat cua doan chua
bool   cargo = true;              // con hang tren xe?
int    lineCount = 0;             // so mat thay den o lan doc gan nhat
const float MIN_EDGE = 120;       // mm toi thieu 1 doan truoc khi cho ket thuc
const float MAX_EDGE = 750;       // mm toi da 1 doan (chan runaway neu miss giao diem)
int    INTERSECT_N = 4;           // >= so mat thay den => coi la giao diem (nga tu).
                                  // Do thuc te: giao diem CHU T (nhanh vao o) chi cho cnt=4
                                  // (stub lech 1 ben, khong doi xung nhu giao diem chu thap)
                                  // -> nguong 5 (cu) KHONG BAO GIO nhan ra giao diem chu T,
                                  // xe di thang qua toi khi cham MAX_EDGE moi dung an toan.
int    CENTER_OFFSET_MM = 145;    // sau khi thay nga tu, bo them de canh TRUC BANH vao tam
                                  // = k/c thanh cam bien -> truc banh sau (DA DO: 145mm)
float  centerStartMM = 0;         // moc quang duong khi bat dau bo canh tam
// Sau khi RE xong, cam bien (truoc truc 145mm) thuong CHUA nam tren nhanh moi.
// Thay vi XOAY TAI CHO de do (se quet trung nhanh CU -> chay nguoc), ta BO THANG CHAM
// de dua cam bien len nhanh moi. Khong thay trong REACQUIRE_MAX -> dung an toan.
int    REACQUIRE_SPEED  = 130;    // toc do bo (cham) khi canh tam / tim line
int    REACQUIRE_MAX_MM = 150;    // bo toi da bao nhieu mm de tim; qua -> dung an toan
float  reacqStartMM = 0;

