huygithcm/code_tung/esp32_car/src/main.cpp
  buzzerTone(2600, 150); delay(80); buzzerTone(2600, 250);  // TONE KET THUC (2 beep)
  String rep = "[calib] XONG. thresh:";
  for (int i = 0; i < 8; i++) rep += " C" + String(i + 1) + "=" + String(lineThresh[i]);
  hubLog(rep);
  saveCalibration();   // luu vao NVS de tu nap lan sau
}

// ===================== NVS: luu/nap calibration =====================
void saveCalibration() {
  prefs.begin("line", false);
  prefs.putBytes("thresh", lineThresh, sizeof(lineThresh));
  prefs.putBool("done", true);
  prefs.end();
  Serial.println(F(">> Da luu calibration vao NVS (tu nap lan sau)"));
}
bool loadCalibration() {
  prefs.begin("line", true);
  bool done = prefs.getBool("done", false);
  if (done) prefs.getBytes("thresh", lineThresh, sizeof(lineThresh));
  prefs.end();
  if (done) {
    lineCalibrated = true;
    Serial.print(F(">> Da nap calibration tu NVS: "));
    for (int i = 0; i < 8; i++) Serial.printf("%d ", lineThresh[i]);
    Serial.println();
  }
  return done;
}

float pulsesToMM(long pulses) {
  float circ = PI * WHEEL_DIAMETER_MM;       // chu vi
  return (float)pulses / ENCODER_PPR * circ; // quang duong
}

void printMenu() {
  Serial.println(F("\n===== MENU TEST / HIEU CHUAN ====="));
  Serial.println(F("--- MOTOR (2 banh) ---"));
  Serial.println(F("  f = ca 2 banh tien     b = ca 2 banh lui"));
  Serial.println(F("  l = quay trai          r = quay phai"));
  Serial.println(F("  1 = chi banh TRAI tien 2 = chi banh PHAI tien"));
  Serial.println(F("  x = dung               + / - = tang/giam toc"));
  Serial.println(F("  v<so> = dat toc do (vd v200)"));
  Serial.println(F("--- ENCODER ---"));
  Serial.println(F("  e = reset bo dem       p = in xung + quang duong"));
  Serial.println(F("--- SERVO ---"));
  Serial.println(F("  o = THA hang           h = GIU hang"));
  Serial.println(F("  s<goc> = dat goc servo (vd s45)"));
  Serial.println(F("  H<goc> = dat goc GIU   D<goc> = dat goc THA"));
  Serial.println(F("--- DO LINE (MUX) ---"));
  Serial.println(F("  m = in 8 mat lien tuc  M = dung in"));
  Serial.println(F("  n = in 8 mat 1 lan"));
  Serial.println(F("  c = CALI line (5s dem nguoc + tone, roi quet cam bien)"));
  Serial.println(F("--- BAM LINE (PID) + ODOMETRY ---"));
  Serial.println(F("  g = bat dau bam line   x = dung"));
  Serial.println(F("  B<so> = toc do co ban  (vd B130)"));
  Serial.println(F("  kp<so> kd<so> ki<so> = chinh he so PID (vd kp25)"));
  Serial.println(F("  q = in vi tri (x,y,theta)   e = reset odometry"));
  Serial.println(F("--- RE (CO DINH: PWM + thoi gian) ---"));
  Serial.println(F("  T<goc> = re tai cho (vd T90, T-90)"));
  Serial.println(F("  Tm<so> = PWM re co dinh (chung 2 ben)"));
  Serial.println(F("  TsL<so> TsR<so> = ms/do rieng trai/phai   ToL<so> ToR<so> = ms chet rieng"));
  Serial.println(F("  TI = dao chieu actuation vong re"));
  Serial.println(F("--- CAU HINH MANG (WiFi + IP laptop) ---"));
  Serial.println(F("  Wn<ten> = ten WiFi     Wp<mk> = mat khau"));
  Serial.println(F("  Wh<ip>  = IP laptop    Ws = luu + ket noi lai"));
  Serial.println(F("  W       = xem cau hinh hien tai"));
  Serial.println(F("--- KHAC ---"));
  Serial.println(F("  z = buzzer beep        ? = menu nay"));
  Serial.println(F("==================================\n"));
}

// ===================== Xu ly lenh =====================
void handleCommand(String cmd) {
  cmd.trim();
  if (cmd.length() == 0) return;
  char c = cmd.charAt(0);

  switch (c) {
    // ----- Motor -----
    case 'f': setMotorA(+1, motorSpeed); setMotorB(+1, motorSpeed);
              Serial.println("Ca 2 banh TIEN"); break;
    case 'b': setMotorA(-1, motorSpeed); setMotorB(-1, motorSpeed);
              Serial.println("Ca 2 banh LUI"); break;
    case 'l': setMotorA(-1, motorSpeed); setMotorB(+1, motorSpeed);
              Serial.println("Quay TRAI"); break;
    case 'r': setMotorA(+1, motorSpeed); setMotorB(-1, motorSpeed);
              Serial.println("Quay PHAI"); break;
    case '1': setMotorA(+1, motorSpeed); setMotorB(0, 0);
              Serial.println("Chi banh TRAI tien"); break;
    case '2': setMotorA(0, 0); setMotorB(+1, motorSpeed);
              Serial.println("Chi banh PHAI tien"); break;
    case 'x': lineFollow = false; stopMotors(); Serial.println("DUNG"); break;
    case '+': motorSpeed = min(255, motorSpeed + 10);
              Serial.printf("Toc do = %d\n", motorSpeed); break;
    case '-': motorSpeed = max(0, motorSpeed - 10);
              Serial.printf("Toc do = %d\n", motorSpeed); break;
    case 'v': motorSpeed = constrain(cmd.substring(1).toInt(), 0, 255);
              Serial.printf("Toc do = %d\n", motorSpeed); break;

    // ----- Encoder / Odometry -----
    case 'e': resetOdometry(); Serial.println("Reset encoder + odometry"); break;
    case 'q': printPose(); break;
    case 'p': {
      long l = encL, r = encR;
      Serial.printf("Encoder  L=%ld (%.1f mm)  R=%ld (%.1f mm)\n",
                    l, pulsesToMM(l), r, pulsesToMM(r));
      break;
    }

    // ----- Servo -----
    case 'o': servo.write(SERVO_DROP); Serial.printf("THA hang (goc %d)\n", SERVO_DROP); break;
    case 'h': servo.write(SERVO_HOLD); Serial.printf("GIU hang (goc %d)\n", SERVO_HOLD); break;
    case 's': { int a = constrain(cmd.substring(1).toInt(), 0, 180);
                servo.write(a); Serial.printf("Servo -> %d do\n", a); break; }
    case 'H': SERVO_HOLD = constrain(cmd.substring(1).toInt(), 0, 180);
              Serial.printf("Goc GIU = %d\n", SERVO_HOLD); break;
    case 'D': SERVO_DROP = constrain(cmd.substring(1).toInt(), 0, 180);
              Serial.printf("Goc THA = %d\n", SERVO_DROP); break;

    // ----- Tu test motor -----
    case 't': {
      Serial.println(">> TEST: A tien 1.5s");
      setMotorA(+1, 200); setMotorB(0,0); delay(1500);
      Serial.println(">> TEST: A lui 1.5s");
      setMotorA(-1, 200); delay(1500); stopMotors(); delay(500);
      Serial.println(">> TEST: B tien 1.5s");
      setMotorB(+1, 200); setMotorA(0,0); delay(1500);
      Serial.println(">> TEST: B lui 1.5s");
      setMotorB(-1, 200); delay(1500); stopMotors();
      Serial.println(">> TEST xong");
      break;
    }
    // ----- Re co dinh (open-loop) -----
    case 'T':
      if (cmd.length() > 1 && cmd.charAt(1) == 'I') { INVERT_TURN = !INVERT_TURN; Serial.printf("INVERT_TURN=%d\n", INVERT_TURN); }
      else if (cmd.length() > 1 && cmd.charAt(1) == 'm') { TURN_OPEN_PWM = cmd.substring(2).toInt(); Serial.printf("TURN_OPEN_PWM=%d\n", TURN_OPEN_PWM); }
      else if (cmd.length() > 2 && cmd.charAt(1) == 's' && cmd.charAt(2) == 'L') { TURN_MS_PER_DEG_L = cmd.substring(3).toFloat(); Serial.printf("TURN_MS_PER_DEG_L=%.2f\n", TURN_MS_PER_DEG_L); }
      else if (cmd.length() > 2 && cmd.charAt(1) == 's' && cmd.charAt(2) == 'R') { TURN_MS_PER_DEG_R = cmd.substring(3).toFloat(); Serial.printf("TURN_MS_PER_DEG_R=%.2f\n", TURN_MS_PER_DEG_R); }
      else if (cmd.length() > 2 && cmd.charAt(1) == 'o' && cmd.charAt(2) == 'L') { TURN_MS_OFFSET_L = cmd.substring(3).toFloat(); Serial.printf("TURN_MS_OFFSET_L=%.1f\n", TURN_MS_OFFSET_L); }
      else if (cmd.length() > 2 && cmd.charAt(1) == 'o' && cmd.charAt(2) == 'R') { TURN_MS_OFFSET_R = cmd.substring(3).toFloat(); Serial.printf("TURN_MS_OFFSET_R=%.1f\n", TURN_MS_OFFSET_R); }
      else {
        float deg = cmd.substring(1).toFloat();
        Serial.printf(">> Re %.0f do...\n", deg);
        turnRelative(deg);
      }
      break;

    case 'i': // dao chieu runtime: iA hoac iB
      if (cmd.indexOf('A') > 0 || cmd.indexOf('a') > 0) { INVERT_A = !INVERT_A; Serial.printf("INVERT_A=%d\n", INVERT_A); }
      else if (cmd.indexOf('B') > 0 || cmd.indexOf('b') > 0) { INVERT_B = !INVERT_B; Serial.printf("INVERT_B=%d\n", INVERT_B); }
      else Serial.println("Dung: iA hoac iB");
      break;

