huygithcm/code_tung/esp32_car/src/main.cpp
// Ket thuc don (da ve HOME): dung, san sang don ke tiep.
void finishRoute() {
  stopMotors(); lineFollow = false;
  running = false; stepPhase = 0;
  routeTarget = ""; cargo = true;
  hubLog("[route] xong -> ve HOME, san sang");
  sendTelemetry();
}

// Nap chuoi buoc tu hub va bat dau. Re-anchor odometry tai HOME.
// dists: khoang cach (mm) ky vong song song voi steps (co the rong/thieu phan tu neu
// hub cu chua gui - khi do routeDist[] mac dinh 0, quay ve hanh vi cu MIN_EDGE co dinh).
void startRoute(JsonArrayConst steps, JsonArrayConst dists, const char* target) {
  routeN = 0;
  for (JsonVariantConst v : steps) {
    if (routeN >= 48) break;
    route[routeN] = String(v.as<const char*>());
    routeDist[routeN] = (routeN < (int)dists.size()) ? dists[routeN].as<float>() : 0.0f;
    routeN++;
  }
  routeIdx = 0; stepPhase = 0; leftStart = false;
  routeTarget = target ? target : "";
  cargo = true;
  resetOdometry();            // xe dang o HOME -> xoa troi tich luy
  running = true;
  hubLog("[route] bat dau -> " + routeTarget + " (" + String(routeN) + " buoc)");
}

// Chay 1 nhip cua route (goi trong loop khi running).
// Moi buoc F/L/R/B = RE truoc (0/+90/-90/180) roi TIEN 1 canh toi giao diem/het line.
void routeStep() {
  if (routeIdx >= routeN) { finishRoute(); return; }
  String s = route[routeIdx];

  if (s == "DROP") { doDrop(); routeIdx++; return; }
  if (s == "HOME") {
    // Nhanh HOME tren map chi noi 1 chieu (tu luoi di ra) -> xe LUON toi HOME voi
    // huong ~180 do (nguoc voi luc xuat phat, nhin +x=0 do). Xoay lai ve 0 do de
    // san sang cho chuyen giao ke tiep. Quay xong PHAI bo TIM LAI line (giong het
    // pha 3 cac buoc re khac) truoc khi ket thuc that su - khong lam vay, sai so
    // quay (~5-8 do) de cam bien dung LECH khoi line that, chuyen giao KE TIEP se
    // "khong thay line" ngay tu buoc dau tien (da xay ra thuc te).
    if (stepPhase == 0) {
      turnRelative(180);
      reacqStartMM = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f;
      stepPhase = 3;
      return;
    }
    // stepPhase == 3: bo CAN CHINH lai line (khong chuyen tiep sang bam line - day la
    // buoc cuoi cung, chi can dung dung tren line la xong).
    // Dung nguong >=2 mat (chu khong phai >=1 nhu reacquire thuong): day la LAN KIEM TRA
    // DAU TIEN ngay sau khi dung yen (0mm di chuyen) - 1 mat le co the bao DUONG TINH GIA
    // do nhieu/mat hong, khien code bao "xong" ngay ma xe CHUA HE bo chinh gi (da xay ra
    // thuc te: xe LECH han khoi line nhung van bao thanh cong).
    computeLineError();
    if (lineCount >= 2 && !lineLost) { stepPhase = 0; routeIdx++; return; }  // da can lai line -> xong that
    float d = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f - reacqStartMM;
    if (d > REACQUIRE_MAX_MM) {   // bo qua xa van khong thay -> thoi, cu ket thuc (tranh xe ket mai)
      hubLog("[route] Ve HOME: khong can lai duoc line sau khi quay - van coi la xong (kiem tra vi tri xe).");
      stepPhase = 0; routeIdx++; return;
    }
    int spd = max(REACQUIRE_SPEED, TURN_OPEN_PWM);
    driveA(spd); driveB(spd);
    return;
  }

  if (stepPhase == 0) {                       // --- Pha 0: re dau doan ---
    float deg = 0;
    if      (s == "L") deg = 90;
    else if (s == "R") deg = -90;
    else if (s == "B") deg = 180;
    if (deg != 0) turnRelative(deg);          // rE tai cho (PID, blocking)
    segStartX = poseX; segStartY = poseY; leftStart = false;
    lastError = 0; errIntegral = 0;
    reacqStartMM = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f;
    stepPhase = 3;                             // -> BO TIM line moi (khong xoay do)
    return;
  }

  // --- Pha 3: sau khi re, BO THANG CHAM de dua cam bien len nhanh moi ---
  if (stepPhase == 3) {
    computeLineError();                        // cap nhat lineCount/lineLost
    if (lineCount >= 1 && !lineLost) {         // da bat duoc line moi
      segStartX = poseX; segStartY = poseY; leftStart = false;
      lastError = 0; errIntegral = 0;
      stepPhase = 1;
      return;
    }
    float d = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f - reacqStartMM;
    if (d > REACQUIRE_MAX_MM) {                // bo qua xa van khong thay -> DUNG AN TOAN
      stopMotors(); running = false; stepPhase = 0;
      hubLog("[route] MAT LINE sau khi re (bo " + String((int)d) + "mm khong thay) -> DUNG. Kiem tra goc re / CENTER_OFFSET.");
      return;
    }
    // Dang dung yen (vua RE xong, van toc = 0) truoc khi bo: REACQUIRE_SPEED (130) co the
    // duoi nguong ma sat tinh khi khoi dong tu dung im hoan toan -> xe "e" tai cho, encoder
    // khong tang, khong bao gio cham REACQUIRE_MAX_MM -> DUNG xuat hien log MAT LINE nhung
    // xe cung khong nhich (giong het bug quay tai cho truoc day). Dung TURN_OPEN_PWM lam san
    // toi thieu de dam bao THUC SU lan banh.
    int spd = max(REACQUIRE_SPEED, TURN_OPEN_PWM);
    driveA(spd); driveB(spd);                  // bo thang, KHONG xoay
    return;
  }

  // --- Pha 2: bo thang them de canh TRUC BANH vao tam nga tu roi moi re ---
  if (stepPhase == 2) {
    float d = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f - centerStartMM;
    if (d < CENTER_OFFSET_MM) { driveA(baseSpeed); driveB(baseSpeed); }   // bo thang
    else { stopMotors(); stepPhase = 0; routeIdx++; }                     // da canh tam -> buoc ke
    return;
  }

  // --- Pha 1: tien bam line den giao diem ke ---
  bool found = computeLineError();          // cap nhat lineCount/lineLost/lineError
  float trav = hypotf(poseX - segStartX, poseY - segStartY);
  if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi nga tu cu
  // Neu map biet truoc khoang cach doan nay (routeDist, gom ca cac buoc F GOP nhieu doan
  // nho lai), dung no lam nguong toi thieu THAY VI MIN_EDGE co dinh -> tranh nhan nham 1
  // giao diem MANH nam GIUA doan (truoc dich that) la "da toi noi", di qua qua som.
  float expectedDist = routeDist[routeIdx];
  float minGate = (expectedDist > MIN_EDGE) ? (expectedDist - REACQUIRE_MAX_MM) : MIN_EDGE;
  float maxGate = (expectedDist > 0) ? max(MAX_EDGE, expectedDist + REACQUIRE_MAX_MM) : MAX_EDGE;
  bool reached = false;
  if (trav > minGate) {
    if (leftStart && (lineCount >= INTERSECT_N || lineLost)) reached = true;  // toi nga tu / het line
    if (trav > maxGate) reached = true;                                       // an toan
  }
  if (reached) {                       // thay nga tu -> canh tam (khong re ngay = tranh re som)
    centerStartMM = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f;
    stepPhase = 2;
    return;
  }
  if (found) lineDrivePID();           // bam line binh thuong
  else { driveA(REACQUIRE_SPEED); driveB(REACQUIRE_SPEED); }  // hut line giua doan -> bo thang, KHONG xoay
}

// ===================== Hieu chuan quang duong =====================
// Chay thang bam line tu giao diem hien tai -> giao diem ke (biet knownMM, mac dinh 475).
//
// ⚠️ DAT XE: THANH CAM BIEN phai nam NGAY TREN vach ngang cua nga tu xuat phat
//    (KHONG phai truc banh!). Ly do: ta dem quang duong tu luc bat dau (cam bien @ nga tu 1)
//    den luc CAM BIEN thay nga tu 2 -> dung bang 1 canh (475mm). Neu can truc banh vao
//    nga tu thi cam bien da o truoc 145mm -> do ra ~330mm -> goi y duong kinh sai.
void calibDistance(float knownMM) {
  running = false; lineFollow = false;
  resetOdometry();
  leftStart = false;
  hubLog("[caldist] Chay toi nga tu ke (biet " + String(knownMM, 0) +
         "mm). Luu y: dat THANH CAM BIEN tren nga tu xuat phat.");

  unsigned long t0 = millis();
  // Quang duong TIEN = trung binh CO DAU cua 2 banh.
  // (Dung fabs() la SAI: khi mat line xe xoay tai cho -> L am, R duong -> fabs cong don
  //  thanh "da di xa" du xe dung im -> so do rac.)
  auto travel = []() { return (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f; };
  const char* why = "TIMEOUT (khong thay nga tu ke)";   // ly do dung
  while (millis() - t0 < 8000) {                 // timeout 8s
    updateOdometry();
    lineFollowStep();                            // bam line 1 nhip
    float trav = travel();
    if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi giao diem xuat phat
    if (trav > MIN_EDGE) {
      if (leftStart && lineCount >= INTERSECT_N) { why = "thay nga tu ke";       break; }
      if (leftStart && lineLost)                 { why = "MAT LINE (do khong tin)"; break; }
      if (trav > MAX_EDGE)                       { why = "qua MAX_EDGE (do khong tin)"; break; }
    }
    delay(5);
  }
  stopMotors();

  float measured = travel();
  bool  ok = (strcmp(why, "thay nga tu ke") == 0) && measured > MIN_EDGE;
  float suggest = (measured > 1) ? WHEEL_DIAMETER_MM * knownMM / measured : WHEEL_DIAMETER_MM;
  char buf[220];
  snprintf(buf, sizeof(buf),
    "[caldist] %s | biet=%.0fmm do=%.1fmm (encL=%ld encR=%ld) | WHEEL_D hien=%.2f -> goi y=%.2fmm%s",
    why, knownMM, measured, encL, encR, WHEEL_DIAMETER_MM, suggest,
    ok ? "" : "   << KHONG DUNG SO NAY, do lai!");
  hubLog(buf);
}

// Su kien WebSocket toi hub.
void onWsEvent(WStype_t type, uint8_t* payload, size_t len) {
  switch (type) {
    case WStype_CONNECTED:
      hubOK = true;
      wsClient.sendTXT("{\"role\":\"car\"}");
      Serial.println("[ws] Da ket noi hub, khai bao role=car");
      hubLog("[fw] build " __DATE__ " " __TIME__);   // danh dau ban firmware dang chay (xac minh OTA)
      break;
    case WStype_DISCONNECTED:
      hubOK = false;
      Serial.println("[ws] Mat ket noi hub");
      break;
    case WStype_TEXT: {
      JsonDocument doc;
      if (deserializeJson(doc, payload, len)) return;   // loi parse -> bo
      const char* cmd = doc["cmd"];
      if (!cmd) return;                                 // hello/khac -> bo qua
      if      (!strcmp(cmd, "route"))  startRoute(doc["steps"].as<JsonArrayConst>(), doc["dists"].as<JsonArrayConst>(), doc["target"] | "");
      else if (!strcmp(cmd, "stop"))   { running = false; lineFollow = false; stopMotors(); routeTarget = ""; hubLog("[ws] STOP"); }
      else if (!strcmp(cmd, "manual")) doManual(String((const char*)(doc["dir"] | "S")));
      else if (!strcmp(cmd, "drop"))   doDrop();
      else if (!strcmp(cmd, "calib"))  { hubLog("[calib] Bat dau hieu chuan line..."); calibrateLine(); }
      else if (!strcmp(cmd, "tune")) {                  // chinh tham so runtime tu web
        if (!doc["base"].isNull())     baseSpeed     = constrain((int)doc["base"], 0, 255);
        if (!doc["min"].isNull())      MOTOR_MIN_PWM = constrain((int)doc["min"], 0, 255);
        if (!doc["kp"].isNull())       Kp = (float)doc["kp"];
        if (!doc["kd"].isNull())       Kd = (float)doc["kd"];
        if (!doc["openpwm"].isNull())    TURN_OPEN_PWM = constrain((int)doc["openpwm"], 0, 255);
        if (!doc["msperdegL"].isNull())  TURN_MS_PER_DEG_L = (float)doc["msperdegL"];
        if (!doc["msperdegR"].isNull())  TURN_MS_PER_DEG_R = (float)doc["msperdegR"];
        if (!doc["msoffsetL"].isNull())  TURN_MS_OFFSET_L = (float)doc["msoffsetL"];
        if (!doc["msoffsetR"].isNull())  TURN_MS_OFFSET_R = (float)doc["msoffsetR"];
        if (!doc["speed"].isNull())    motorSpeed = constrain((int)doc["speed"], 0, 255);
        if (!doc["wheeld"].isNull())   WHEEL_DIAMETER_MM = (float)doc["wheeld"];
        if (!doc["ppr"].isNull())      ENCODER_PPR = (int)doc["ppr"];
        if (!doc["wbase"].isNull())    WHEEL_BASE_MM = (float)doc["wbase"];
        if (!doc["center"].isNull())   CENTER_OFFSET_MM = constrain((int)doc["center"], 0, 300);
        if (!doc["reacqmax"].isNull()) REACQUIRE_MAX_MM = constrain((int)doc["reacqmax"], 20, 500);
        if (!doc["reacqspd"].isNull()) REACQUIRE_SPEED = constrain((int)doc["reacqspd"], 0, 255);
        if (!doc["intersectn"].isNull()) INTERSECT_N = constrain((int)doc["intersectn"], 2, 7);
        if (!doc["trim"].isNull())     LINE_TRIM = (float)doc["trim"];
        if (!doc["gyrow"].isNull())    GYRO_W = constrain((float)doc["gyrow"], 0.0f, 1.0f);
        if (!doc["gyrosign"].isNull()) GYRO_SIGN = ((int)doc["gyrosign"] >= 0) ? 1 : -1;
        hubLog("[tune] base=" + String(baseSpeed) + " min=" + String(MOTOR_MIN_PWM) +
               " kp=" + String(Kp, 1) + " kd=" + String(Kd, 1) +
               " openpwm=" + String(TURN_OPEN_PWM) +
               " msperdegL=" + String(TURN_MS_PER_DEG_L, 2) + " msperdegR=" + String(TURN_MS_PER_DEG_R, 2) +
               " msoffsetL=" + String(TURN_MS_OFFSET_L, 1) + " msoffsetR=" + String(TURN_MS_OFFSET_R, 1) +
               " speed=" + String(motorSpeed) +
               " wheeld=" + String(WHEEL_DIAMETER_MM, 2) + " ppr=" + String(ENCODER_PPR) +
               " wbase=" + String(WHEEL_BASE_MM, 1) + " center=" + String(CENTER_OFFSET_MM) +
               " intersectn=" + String(INTERSECT_N) +
               " gyro=" + String(mpuOK ? "OK" : "--") + " gyrow=" + String(GYRO_W, 2) +
               " gyrosign=" + String(GYRO_SIGN));
      }
      else if (!strcmp(cmd, "turn")) {                  // test 1 cu re (deg): +trai / -phai
        float deg = doc["deg"] | 90.0;
        hubLog("[turn] test re " + String(deg, 0) + " do...");
        turnRelative(deg);
      }
      else if (!strcmp(cmd, "enc")) {                   // doc encoder (hieu chuan chieu dem)
        if (!doc["reset"].isNull()) resetOdometry();
        hubLog("[enc] L=" + String(encL) + " R=" + String(encR) +
               " x=" + String(poseX, 0) + " y=" + String(poseY, 0) +
               " th=" + String(poseTheta * 180.0f / PI, 1) +
               " | gyro=" + String(mpuOK ? "OK" : "--") +
               (mpuOK ? (" wz=" + String((mpuGyroZraw() - gyroBiasZ) / GYRO_LSB_PER_DPS, 1) + "do/s") : ""));
      }
      else if (!strcmp(cmd, "caldist")) {               // hieu chuan quang duong (1 canh line)
        calibDistance(doc["known"] | 475.0);
      }
      else if (!strcmp(cmd, "gyrocal")) {               // do lai troi tinh gyro (xe phai dung yen)
        stopMotors();
        hubLog("[gyro] Do troi tinh - GIU XE DUNG YEN...");
        gyroCalibrate();
      }
      else if (!strcmp(cmd, "i2cscan"))  i2cScan();      // quet bus I2C (tim MPU6050)
      else if (!strcmp(cmd, "line"))     reportLine();   // doc 8 mat line
      else if (!strcmp(cmd, "linezero")) lineSetZero();  // dat tam line = vi tri hien tai
      else if (!strcmp(cmd, "servo")) {                 // test servo tay tu web (KHONG dong cargo/beep)
        if (!doc["angle"].isNull()) {
          int a = constrain((int)doc["angle"], 0, 180);
          servo.write(a);
          hubLog("[servo] -> " + String(a) + " do (test)");
        } else {
          const char* action = doc["action"] | "";
          if      (!strcmp(action, "drop")) { servo.write(SERVO_DROP); hubLog("[servo] THA (test, goc " + String(SERVO_DROP) + ")"); }
          else if (!strcmp(action, "hold")) { servo.write(SERVO_HOLD); hubLog("[servo] GIU (test, goc " + String(SERVO_HOLD) + ")"); }
        }
      }
      break;
    }
    default: break;
  }
}

